Assessments/Capstone junit & jmeter/html_report/statistics.json
{
  "PUT Request" : {
    "transaction" : "PUT Request",
    "sampleCount" : 20,
    "errorCount" : 3,
    "errorPct" : 15.0,
    "meanResTime" : 266.25,
    "medianResTime" : 231.0,
    "minResTime" : 192.0,
    "maxResTime" : 482.0,
    "pct1ResTime" : 387.0,
    "pct2ResTime" : 477.29999999999995,
    "pct3ResTime" : 482.0,
    "throughput" : 2.271694684234439,
    "receivedKBytesPerSec" : 3.618627718934575,
    "sentKBytesPerSec" : 0.5856712857791913
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 80,
    "errorCount" : 10,
    "errorPct" : 12.5,
    "meanResTime" : 275.43749999999994,
    "medianResTime" : 233.5,
    "minResTime" : 192.0,
    "maxResTime" : 1057.0,
    "pct1ResTime" : 381.9,
    "pct2ResTime" : 432.1,
    "pct3ResTime" : 1057.0,
    "throughput" : 7.729468599033816,
    "receivedKBytesPerSec" : 14.234224033816426,
    "sentKBytesPerSec" : 1.7134661835748792
  },
  "POST Request" : {
    "transaction" : "POST Request",
    "sampleCount" : 20,
    "errorCount" : 3,
    "errorPct" : 15.0,
    "meanResTime" : 295.3,
    "medianResTime" : 320.0,
    "minResTime" : 197.0,
    "maxResTime" : 433.0,
    "pct1ResTime" : 393.70000000000005,
    "pct2ResTime" : 431.09999999999997,
    "pct3ResTime" : 433.0,
    "throughput" : 2.2603978300180834,
    "receivedKBytesPerSec" : 3.629991417551989,
    "sentKBytesPerSec" : 0.5628920377486437
  },
  "DELETE  Request" : {
    "transaction" : "DELETE  Request",
    "sampleCount" : 20,
    "errorCount" : 4,
    "errorPct" : 20.0,
    "meanResTime" : 223.50000000000003,
    "medianResTime" : 219.0,
    "minResTime" : 192.0,
    "maxResTime" : 265.0,
    "pct1ResTime" : 257.8,
    "pct2ResTime" : 264.65,
    "pct3ResTime" : 265.0,
    "throughput" : 2.2792022792022792,
    "receivedKBytesPerSec" : 3.458644943019943,
    "sentKBytesPerSec" : 0.5230591168091168
  },
  "GET Request" : {
    "transaction" : "GET Request",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 316.7,
    "medianResTime" : 248.0,
    "minResTime" : 203.0,
    "maxResTime" : 1057.0,
    "pct1ResTime" : 653.5000000000006,
    "pct2ResTime" : 1038.1499999999996,
    "pct3ResTime" : 1057.0,
    "throughput" : 2.0868113522537564,
    "receivedKBytesPerSec" : 5.529846293301336,
    "sentKBytesPerSec" : 0.3138368635225376
  }
}